{"config": [{"config": {"batch_input_shape": [null, 160, 320, 3], "name": "cropping2d_1", "input_dtype": "float32", "trainable": true, "cropping": [[65, 30], [0, 0]]}, "class_name": "Cropping2D"}, {"config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\fmodel_2_1.py\u00da\b<lambda>T\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true, "function_type": "lambda", "output_shape": null, "arguments": {}, "batch_input_shape": [null, 160, 320, 3], "name": "lambda_1", "input_dtype": "float32", "output_shape_type": "raw"}, "class_name": "Lambda"}, {"config": {"activity_regularizer": null, "activation": "elu", "b_constraint": null, "W_constraint": null, "trainable": true, "b_regularizer": null, "init": "glorot_uniform", "nb_row": 5, "nb_filter": 24, "border_mode": "valid", "subsample": [2, 2], "W_regularizer": null, "dim_ordering": "tf", "name": "convolution2d_1", "bias": true, "nb_col": 5}, "class_name": "Convolution2D"}, {"config": {"activity_regularizer": null, "activation": "elu", "b_constraint": null, "W_constraint": null, "trainable": true, "b_regularizer": null, "init": "glorot_uniform", "nb_row": 5, "nb_filter": 36, "border_mode": "valid", "subsample": [2, 2], "W_regularizer": null, "dim_ordering": "tf", "name": "convolution2d_2", "bias": true, "nb_col": 5}, "class_name": "Convolution2D"}, {"config": {"activity_regularizer": null, "activation": "elu", "b_constraint": null, "W_constraint": null, "trainable": true, "b_regularizer": null, "init": "glorot_uniform", "nb_row": 5, "nb_filter": 48, "border_mode": "valid", "subsample": [2, 2], "W_regularizer": null, "dim_ordering": "tf", "name": "convolution2d_3", "bias": true, "nb_col": 5}, "class_name": "Convolution2D"}, {"config": {"activity_regularizer": null, "activation": "elu", "b_constraint": null, "W_constraint": null, "trainable": true, "b_regularizer": null, "init": "glorot_uniform", "nb_row": 3, "nb_filter": 64, "border_mode": "valid", "subsample": [1, 1], "W_regularizer": null, "dim_ordering": "tf", "name": "convolution2d_4", "bias": true, "nb_col": 3}, "class_name": "Convolution2D"}, {"config": {"activity_regularizer": null, "activation": "elu", "b_constraint": null, "W_constraint": null, "trainable": true, "b_regularizer": null, "init": "glorot_uniform", "nb_row": 3, "nb_filter": 64, "border_mode": "valid", "subsample": [1, 1], "W_regularizer": null, "dim_ordering": "tf", "name": "convolution2d_5", "bias": true, "nb_col": 3}, "class_name": "Convolution2D"}, {"config": {"p": 0.2, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "activation": "elu", "bias": true, "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "input_dim": 2112, "W_regularizer": null, "name": "dense_1", "trainable": true, "output_dim": 100}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "activation": "elu", "bias": true, "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "input_dim": 100, "W_regularizer": null, "name": "dense_2", "trainable": true, "output_dim": 50}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "activation": "elu", "bias": true, "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "input_dim": 50, "W_regularizer": null, "name": "dense_3", "trainable": true, "output_dim": 10}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "activation": "linear", "bias": true, "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "input_dim": 10, "W_regularizer": null, "name": "dense_4", "trainable": true, "output_dim": 1}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.1"}